app/Controllers/API/StudentsController.php

    public function index()
    {
        $model = new UserModel();

        // Fetch all users (since this is for a screenshot, findAll is safest)
        $students = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL

    public function show($id = null)
    {
        if (! $id) {
            return $this->respondFail('Please provide a student ID.', 400);
        }

        $model = new UserModel();
        // Use find($id) instead of the missing getStudentById()
        $student = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'