app/Controllers/Admin/UserAdminController.php

UPDATE `users` SET `role_id` = '3'
WHERE `id` = '10'
---
    public function assignRole($id)
    {
        // Block admin from changing their own role
        if ($id == session('user')['id']) {
            return redirect()->to('/admin/users')
                ->with('error', 'You cannot change your own role.');
        }

        $this->db->table('users')->update(
            ['role_id' => $this->request->getPost('role_id')],
            ['id'      => $id]
        );