app/Filters/ApiAuthFilter.php

SELECT `t`.*, `u`.`id` as `user_id`, `u`.`name`, `u`.`email`, `r`.`name` as `role_name`
FROM `api_tokens` `t`
JOIN `users` `u` ON `u`.`id` = `t`.`user_id`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
WHERE `t`.`token` = 'a6d961a50828149547bd45e2bb8778ae67ed0f556da17e7c92ac1ab5c97e6894'
AND `u`.`deleted_at` IS NULL
---
   public function before(RequestInterface $request, $arguments = null)
{
    $authHeader = $request->getHeaderLine('Authorization');

    if (empty($authHeader) || ! str_starts_with($authHeader, 'Bearer ')) {
        return service('response')
            ->setStatusCode(401)
            ->setJSON([
                'success' => false,
                'message' => 'Access denied. No valid authorization header found.',
            ]);
    }

    $tokenString = trim(substr($authHeader, 7));
    $db          = db_connect();

    // FIXED: changed leftJoin() to join(..., 'left')
    // FIXED: changed $token to $tokenString to match your variable above
    // FIXED: changed $user to $record to match your "if (!$record)" check below
    $record = $db->table('api_tokens t')
        ->select('t.*, u.id as user_id, u.name, u.email, r.name as role_name')
        ->join('users u', 'u.id = t.user_id')
        ->join('roles r', 'r.id = u.role_id', 'left')
        ->where('t.token', $tokenString)
        ->where('u.deleted_at', null)
        ->get()
        ->getRowArray();