app/Controllers/AuthController.php

SELECT `users`.*, `roles`.`name` AS `role_name`
FROM `users`
LEFT JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`email` = 'izaac@admin.com'
---
    public function loginPost()
{
    $db       = \Config\Database::connect();
    $email    = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    // JOIN roles table to get role name alongside user data
    $user = $db->table('users')
               ->select('users.*, roles.name AS role_name')
               ->join('roles', 'roles.id = users.role_id', 'left')
               ->where('users.email', $email)
               ->get()
               ->getRowArray();

SELECT *
FROM `roles`
WHERE `name` = 'student'
INSERT INTO `users` (`name`, `email`, `password`, `role_id`, `created_at`, `updated_at`) VALUES ('Rodel II C. Torrecampo', 'rodellii@school.edu', '$2y$12$wRVz5hhLv82HQ9m/n532JO4wN96mZ.g62e7zC8PcyFhQp5asu115u', '3', '2026-03-20 14:06:15', '2026-03-20 14:06:15')
---
    public function registerPost()
{
    $rules = [
        'name'             => 'required|min_length[3]',
        'email'            => 'required|valid_email|is_unique[users.email]',
        'password'         => 'required|min_length[6]',
        'confirm_password' => 'required|matches[password]',
    ];

    if (! $this->validate($rules)) {
        return redirect()->back()
            ->withInput()
            ->with('errors', $this->validator->getErrors());
    }

    $db     = \Config\Database::connect();
    $model  = new \App\Models\UserModel();

    // Get the student role ID automatically
    $studentRole = $db->table('roles')->where('name', 'student')->get()->getRowArray();
    $roleId      = $studentRole ? $studentRole['id'] : null;

    $model->insert([
        'name'       => $this->request->getPost('name'),
        'email'      => $this->request->getPost('email'),
        'password'   => password_hash(
                            $this->request->getPost('password'),
                            PASSWORD_BCRYPT
                        ),
        'role_id'    => $roleId,
        'created_at' => date('Y-m-d H:i:s'),
    ]);