app/Controllers/ProfileController.php

    public function show()
    {
        $userId    = session()->get('userId');
        $userModel = new UserModel();

        // Get fresh data from database
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '11'

    public function edit()
    {
        $userId    = session()->get('userId');
        $userModel = new UserModel();

        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '11'

   public function update()
{
    $userId    = session()->get('userId');
    $userModel = new UserModel();

    // Step 1 — Get current user record
    $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '11'

    ];

    // Step 7 — Save to database
    $userModel->updateProfile($userId, $updateData);
---
UPDATE `users` SET `name` = 'Rodel II C. Torrecampo', `email` = 'rodellii@school.edu', `student_id` = '423078957', `course` = 'BSIT', `year_level` = '1', `section` = '7', `phone` = '09684012544', `address` = '1664 Onyx St, 1017, Barangay 775, Manila, First District, Manila', `profile_image` = 'avatar_11_1774015638.png'
WHERE `id` = '11'