app/Controllers/RecordController.php

SELECT *
FROM `records`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data['records'] = $this->model
            ->orderBy('created_at', 'DESC')
            ->findAll();