app/Controllers/StudentController.php

    public function dashboard()
    {
        $db   = \Config\Database::connect();
        $user = $db->table('users')
                   ->where('id', session('user')['id'])
                   ->get()
                   ->getRowArray();
---
SELECT *
FROM `users`
WHERE `id` = '11'