app/Models/TokenModel.php

INSERT INTO `api_tokens` (`user_id`, `token`, `expires_at`, `created_at`) VALUES (17, 'a6d961a50828149547bd45e2bb8778ae67ed0f556da17e7c92ac1ab5c97e6894', '2026-04-16 11:15:38', '2026-04-15 11:15:38')
---
    public function saveToken(int $userId, string $token, string $expiresAt): void
    {
        $this->db->table($this->table)->insert([
            'user_id'    => $userId,
            'token'      => $token,
            'expires_at' => $expiresAt,
            'created_at' => date('Y-m-d H:i:s'),
        ]);

DELETE FROM `api_tokens`
WHERE `token` = 'a6d961a50828149547bd45e2bb8778ae67ed0f556da17e7c92ac1ab5c97e6894'
---
    public function removeToken(string $token): void
    {
        $this->db->table($this->table)->where('token', $token)->delete();