app/Models/UserModel.php

    public function updateProfile(int $userId, array $data): bool
    {
        return $this->update($userId, $data);
---
UPDATE `users` SET `name` = 'clarence combes', `email` = 'combes.izaac@gmail.com', `student_id` = '423004239', `course` = 'BSIT', `year_level` = '3', `section` = '7', `phone` = '09664009377', `address` = '1664 Onyx St, 1017, Barangay 775, Manil, First District, Manila', `profile_image` = 'avatar_1_1773321955.png'
WHERE `users`.`id` IN (1)