app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'izaac@admin.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function findByEmail(string $email): ?array
    {
        return $this->where('email', $email)->first();

SELECT `u`.*, `r`.`name` AS `role_name`, `r`.`label` AS `role_label`
FROM `users` `u`
LEFT JOIN `roles` `r` ON `r`.`id` = `u`.`role_id`
WHERE `u`.`id` = 11
AND `u`.`deleted_at` IS NULL
---
    public function findWithRole(int $id): ?array
    {
        return $this->db->table('users u')
            ->select('u.*, r.name AS role_name, r.label AS role_label')
            ->join('roles r', 'r.id = u.role_id', 'left')
            ->where('u.id', $id)
            ->where('u.deleted_at IS NULL')
            ->get()
            ->getRowArray();